#include <avr/io.h>
#include <avr/pgmspace.h>
#include <util/delay.h>

#include <stdlib.h>
#include <string.h>

#include "vs1053/vs1053.h"
#include "spi/spi.h"

#if 0
static const uint8_t vs1053_patch_v1_95[] PROGMEM = {
  0x0007, 0x0001, 0x8300, 0x0006, 0x04c2, 0xb080, 0x1402, 0x0fdf, /*    0 */
  0xffc1, 0x0007, 0x9257, 0xb212, 0x3c00, 0x3d00, 0x4024, 0x0030, /*    8 */
  0x0297, 0x3f00, 0x0024, 0x0000, 0x0401, 0x000a, 0x1055, 0x0006, /*   10 */
  0x0017, 0x3f10, 0x3401, 0x000a, 0x2795, 0x3f00, 0x3401, 0x0001, /*   18 */
  0x4717, 0xf400, 0x55c0, 0x0000, 0x0817, 0xf400, 0x57c0, 0xc090, /*   20 */
  0x0024, 0x0006, 0x0297, 0x3f00, 0x0024, 0x0000, 0x0000, 0x0007, /*   28 */
  0x81d7, 0x3f10, 0x0024, 0x3f10, 0x0024, 0x0006, 0x01d7, 0x3f00, /*   30 */
  0x0024, 0x0000, 0x190d, 0x000f, 0xf94f, 0x0000, 0xca0e, 0x280f, /*   38 */
  0xe100, 0x0006, 0x2016, 0x0000, 0x0080, 0x0005, 0x4f92, 0x3009, /*   40 */
  0x2800, 0x2909, 0xf840, 0x3613, 0x0024, 0x0006, 0x0197, 0x0006, /*   48 */
  0xa115, 0xb080, 0x0024, 0x3f00, 0x3400, 0x0007, 0x8a57, 0x3700, /*   50 */
  0x0024, 0x4080, 0x0024, 0x0000, 0x0040, 0x2800, 0xcbd5, 0x0006, /*   58 */
  0xa2d7, 0x3009, 0x3c00, 0x0006, 0xa157, 0x3009, 0x1c00, 0x0006, /*   60 */
  0x01d7, 0x0000, 0x190d, 0x000a, 0x708f, 0x0000, 0xd4ce, 0x290b, /*   68 */
  0x1a80, 0x3f00, 0x184c, 0x0030, 0x0017, 0x4080, 0x1c01, 0x0000, /*   70 */
  0x0200, 0x2800, 0xc7d5, 0xb102, 0x0024, 0x0000, 0xca08, 0x2800, /*   78 */

  0x0006, 0xc351, 0x2800, 0x5311, 0x0006, 0xa093, 0xb880, 0x0024, /*  708 */
  0x2800, 0x6380, 0x3009, 0x2c00, 0x4040, 0x0024, 0x6012, 0x0024, /*  710 */
  0x0006, 0xc6d0, 0x2800, 0x6398, 0x0006, 0xc693, 0x3009, 0x0c00, /*  718 */
  0x3009, 0x0001, 0x6014, 0x0024, 0x0006, 0xc350, 0x2800, 0x6381, /*  720 */
  0x0000, 0x0024, 0x6090, 0x0024, 0x3009, 0x2c00, 0x3009, 0x0005, /*  728 */
  0x2900, 0x0b80, 0x0000, 0x6388, 0x3009, 0x0400, 0x4080, 0x0024, /*  730 */
  0x0003, 0x8000, 0x2800, 0x6385, 0x0000, 0x0024, 0x6400, 0x0024, /*  738 */
  0x0000, 0x0081, 0x2800, 0x6389, 0x0007, 0x8c13, 0x3300, 0x0024, /*  740 */
  0xb010, 0x0024, 0x0006, 0xc650, 0x2800, 0x6395, 0x0001, 0x0002, /*  748 */
  0x3413, 0x0000, 0x3009, 0x0401, 0x4010, 0x8406, 0x0000, 0x0281, /*  750 */
  0xa010, 0x13c1, 0x4122, 0x0024, 0x0000, 0x03c2, 0x6122, 0x8002, /*  758 */
  0x462c, 0x0024, 0x469c, 0x0024, 0xfee2, 0x0024, 0x48be, 0x0024, /*  760 */
  0x6066, 0x8400, 0x0006, 0xc350, 0x2800, 0x6381, 0x0000, 0x0024, /*  768 */
  0x4090, 0x0024, 0x3009, 0x2400, 0x2900, 0x0b80, 0x3009, 0x0005, /*  770 */
  0x2912, 0x0d00, 0x3613, 0x0024, 0x3a00, 0x0024, 0x36f4, 0xc024, /*  778 */
  0x36f4, 0x1811, 0x36f1, 0x9807, 0x36f1, 0x1805, 0x36f0, 0x9803, /*  780 */
  0x36f0, 0x1801, 0x3405, 0x9014, 0x36f3, 0x0024, 0x36f2, 0x1815, /*  788 */
  0x2000, 0x0000, 0x36f2, 0x9817, 0x000a, 0x0001, 0x0300,
};

#define VS1053_PATCH vs1053_patch_v1_95
#endif

#if 0
static const uint8_t vs1053_ima_patch_v1_0[] PROGMEM = {
  0x0007, 0x0001, 0x8010, 0x0006, 0x001c, 0x3e12, 0xb817, 0x3e14, /*    0 */
  0xf812, 0x3e01, 0xb811, 0x0007, 0x9717, 0x0020, 0xffd2, 0x0030, /*    8 */
  0x11d1, 0x3111, 0x8024, 0x3704, 0xc024, 0x3b81, 0x8024, 0x3101, /*   10 */
  0x8024, 0x3b81, 0x8024, 0x3f04, 0xc024, 0x2808, 0x4800, 0x36f1, /*   18 */
  0x9811, 0x0007, 0x0001, 0x8028, 0x0006, 0x0002, 0x2a00, 0x040e,
};
#endif

#define VS1053_XCS_SHARED
#define VS1053_SPI_TRANSACTIONS
/* #define VS1053_SPI_HIGHEST_SPEED */

// CLK freq = 12.288MHz[FREQ=0/default] * 3.5[MULT=4] = 43.008MHz
#define VS1053_CLKI_43008KHZ  0x9800

#define VS1053_CLKI_SPEED_KHZ 43008UL

#if !defined(VS1053_XCS_SHARED)
#define VS1053_XDCS_DDR    DDRA
#define VS1053_XDCS_PORT   PORTA
#define VS1053_XDCS_BIT    0
#endif

#define VS1053_DREQ_DDR    DDRA
#define VS1053_DREQ_PORT   PINA
#define VS1053_DREQ_PU     PORTA
#define VS1053_DREQ_BIT    1

#define VS1053_XRES_DDR    DDRA
#define VS1053_XRES_PORT   PORTA
#define VS1053_XRES_BIT    2

#define VS1053_XCS_DDR     DDRA
#define VS1053_XCS_PORT    PORTA
#define VS1053_XCS_BIT     3

#define VS1053_DATA_CHUNK_SIZE 32

#if defined(VS1053_XCS_SHARED)
#define VS1053_MODE_REG_VALUE (0                \
            | (1<<VS1053_SCI_REG_MODE_SDINEW)   \
            | (1<<VS1053_SCI_REG_MODE_SDISHARE) \
            | (1<<VS1053_SCI_REG_MODE_RESET))
#else
#define VS1053_MODE_REG_VALUE (0                \
            | (1<<VS1053_SCI_REG_MODE_SDINEW)   \
            | (1<<VS1053_SCI_REG_MODE_RESET))
#endif

#define VS1053_PARAMETRIC_ADDRESS 0x1E02
#define VS1053_PARAMETRIC_VERSION 0x0003

struct vs1053_parametric {
    /* configs are not cleared between files */
    uint16_t version;       /* 0x1E02      structure version */
    uint16_t config1;       /* 0x1E03      ---- ---- ppss RRRR PS mode, SBR mode, Reverb */
    uint16_t playSpeed;     /* 0x1E04      0,1 = normal speed, 2 = twice, 3 = three times etc. */
    uint16_t byteRate;      /* 0x1E05      average byterate */
    uint16_t endFillByte;   /* 0x1E06      byte value to send after file sent */
    uint16_t reserved[16];  /* 0x1E07..15  file byte offsets */
    uint32_t jumpPoints[8]; /* 0x1E16..25  file byte offsets */
    uint16_t latestJump;    /* 0x1E26      index to lastly updated jumpPoint */
    uint32_t positionMsec;  /* 0x1E27-28   play position, if known (WMA, Ogg Vorbis) */
    int16_t resync;         /* 0x1E29      > 0 for automatic m4a, ADIF, WMA resyncs */
    union {
        struct {
            uint32_t curPacketSize;
            uint32_t packetSize;
        } wma;
        struct {
            uint16_t sceFoundMask;   /* 0x1E2a   SCE's found since last clear */
            uint16_t cpeFoundMask;   /* 0x1E2b   CPE's found since last clear */
            uint16_t lfeFoundMask;   /* 0x1E2c   LFE's found since last clear */
            uint16_t playSelect;     /* 0x1E2d   0 = first any, initialized at aac init */
            int16_t dynCompress;     /* 0x1E2e   -8192=1.0, initialized at aac init */
            int16_t dynBoost;        /* 0x1E2f   8192=1.0, initialized at aac init */
            uint16_t sbrAndPsStatus; /* 0x1E30   1=SBR, 2=upsample, 4=PS, 8=PS active */
        } aac;
        struct {
            uint32_t bytesLeft;
        } midi;
        struct {
            int16_t gain; /* 0x1E2a proposed gain offset in 0.5dB steps, default = -12 */
        } vorbis;
    } i;
};

#define VS1053_PARAMETRIC_ENDFILLBYTE_ADDRESS (VS1053_PARAMETRIC_ADDRESS + __builtin_offsetof(struct vs1053_parametric, endFillByte))
#define VS1053_PARAMETRIC_VERSION_ADDRESS     (VS1053_PARAMETRIC_ADDRESS + __builtin_offsetof(struct vs1053_parametric, version))

#define min(a,b) ((a) < (b) ? (a) : (b))

static inline void vs1053_wait_data_request(void)
{
    while (!(VS1053_DREQ_PORT & (1<<VS1053_DREQ_BIT)));
}

static inline void vs1053_enable_cs(void)
{
    _delay_us(2*(1000./(double)VS1053_CLKI_SPEED_KHZ)); // tXCS  : 2 CLKI
    VS1053_XCS_PORT &= ~(1 << VS1053_XCS_BIT);
    _delay_us(0.005); // tXCSS : 5 ns
}

static inline void vs1053_disable_cs(void)
{
    _delay_us(1000./(double)VS1053_CLKI_SPEED_KHZ); // tXCSH : 1 CLKI
    VS1053_XCS_PORT |= 1 << VS1053_XCS_BIT;
}

#if !defined(VS1053_XCS_SHARED)
static inline void vs1053_enable_dcs(void)
{
